// src/components/EmergencyContacts.js
import React from 'react';
import './EmergencyContacts.css';

function EmergencyContacts({ onClose }) {
  return (
    <div className="emergency-container">
      <div className="emergency-content">
        <h2>အရေးပေါ် ကူညီကယ်ဆယ်ရေး နံပတ်များ</h2>
        <div className="contact-search">
          <input 
            type="text" 
            placeholder="ရှာဖွေရန် (ဥပမာ - မန္တလေး, ကယ်ဆယ်ရေး)" 
            onChange={(e) => handleSearch(e.target.value)}
          />
        </div>
        <div className="emergency-text">
          <div className="region">
            <h3>မန္တလေး</h3>
            <ul>
              <li>09402600033 (မဟာ - လူမှုကယ်ဆယ်ရေး မန္တလေး)</li>
              <li>အမရပူရမြိုနယ် 02-4070713, 02-4070996</li>
              <li>ပြည်ကြီးတံခွန်မြိုနယ် 02-5154974</li>
              <li>ပုသိမ်ကြီးမြိုနယ် 02-4058056</li>
              <li>ချမ်းမြသာစည်မြိုနယ် 02-4021087, 02-4062718</li>
              <li>မဟာအောင်မြေမြိုနယ် 02-4076362</li>
              <li>အောင်မြေသာစံမြိုနယ် 02-4060200</li>
              <li>ချမ်းအေးသာစံမြိုနယ် 02-4060738</li>
            </ul>
          </div>

          <div className="region">
            <h3>အမရပူရမြိုနယ်</h3>
            <ul>
              <li>ဦးထွန်းနေနွယ်(ဒု ဦးစီး) 09404080191 အမရပူရမြိုနယ် မီးသတ်စခန်း</li>
              <li>ဦးကျော်နိုင်ဝင်း(စခန်းမှုး) 0429551689 မြစ်ငယ်နယ်မြေခံမီးသတ်စခန်း</li>
              <li>ဦးဇော်မင်းဦး (တပ်ကြပ်ကြီး) 09444032583 အမရပူရမြိုနယ် မီးသတ်စခန်း</li>
              <li>ဦးအောင်မျိုးကျော် (တပ်ကြပ်ကြီး) 09449637974 အမရပူရမြိုနယ် မီးသတ်စခန်း</li>
              <li>ဦးဖြိုးဇင်(တပ်ကြပ်ကြီး) 09783299191 မြစ်ငယ်မီးသတ်စခန်း</li>
              <li>ဦးစည်သူဇော် 09-959984191 အမရပူရ အရှေ့ခြမ်း စွယ်တော်</li>
              <li>ဦးသဲဦး 09-402574094 အမရပူရ အရှေ့ခြမ်း ဖျောက်ဆိပ်ကုန်း</li>
              <li>ဦးစံသိန်း 09448197750 အမရပူရ အရှေ့ခြမ်း နတ်ရေကန်အရန်မီးသတ်စခန်း တာဝန်ခံ</li>
              <li>ဦးစည်သူအောင် 09445765287 အမရပူရ အရှေ့ခြမ်း နတ်ရေကန်အရန်မီးသတ်စခန်း</li>
              <li>ဦးဇင်ကို 09451801862 အမရပူရ အနောက်ခြမ်း ရှမ်းကလေးကျွန်း</li>
              <li>09-767119119 (အမပူရမြိုနယ် မြန်မာနိုင်ငံ လူမှုကယ်ဆယ်ရေးအဖွဲ)</li>
              <li>09-787119119 (အမပူရမြိုနယ် မြန်မာနိုင်ငံ လူမှုကယ်ဆယ်ရေးအဖွဲ)</li>
              <li>09-440119119 (အမပူရမြိုနယ် မြန်မာနိုင်ငံ လူမှုကယ်ဆယ်ရေးအဖွဲ)</li>
              <li>09988144119 (Myanmar Rescue Amarapura ကိုဥက္ကာကျော်)</li>
            </ul>
          </div>

          <div className="region">
            <h3>နေပြည်တော် #နေပြည်တော်သီးသန့်</h3>
            <ul>
              <li>09420722222 (ရွှေပြည်တော်သို့ဆုံမှတ်ပရဟိတအသင်း)</li>
              <li>09423671702 (ရွှေပြည်တော်သို့ဆုံမှတ်ပရဟိတအသင်း)</li>
              <li>0673404666 (လူမှုဝန်ထမ်း၊ ကယ်ဆယ်ရေးနှင့် ပြန်လည်နေရာချထားရေးဝန်ကြီးဌာန)</li>
              <li>0673404777 (လူမှုဝန်ထမ်း၊ ကယ်ဆယ်ရေးနှင့် ပြန်လည်နေရာချထားရေးဝန်ကြီးဌာန)</li>
              <li>09972755311</li>
              <li>09420771405 (မိုးစေတနာ)</li>
              <li>09404590001 (မိုးစေတနာ)</li>
              <li>09677080162 (တပ်ကုန်းမီးသတ်)</li>
              <li>09677080126 (တပ်ကုန်းမီးသတ်)</li>
            </ul>
          </div>

          <div className="region">
            <h3>လူမှုကရုဏာရှင်အဖွဲ့</h3>
            <ul>
              <li>09681000095</li>
              <li>09797604667</li>
              <li>09775207713</li>
              <li>09972755311</li>
              <li>0943106850 (တပ်ကုန်းရေဘေး)</li>
              <li>095044564 (ပုဗ္ဗတွဲလက်များ)</li>
              <li>09448535275 (နေပြည်တော်ကြက်ခြေနီသူနာပြုတပ်ဖွဲ့)</li>
              <li>09420714432 (နေပြည်တော်ကြက်ခြေနီသူနာပြုတပ်ဖွဲ့)</li>
              <li>09404050511 (မြတ်ပါရမီလူမှုကူညီရေးအသင်း)</li>
              <li>09429319960 (မြတ်ပါရမီလူမှုကူညီရေးအသင်း)</li>
              <li>09420104504 (စိုးမိုးသူလူမှုကူညီရေးအသင်း)</li>
              <li>09253095834 (စိုးမိုးသူလူမှုကူညီရေးအသင်း)</li>
              <li>09254080946 (စိုးမိုးသူလူမှုကူညီရေးအသင်း)</li>
              <li>09445599676 (ပုညကာရီလူမှုကယ်ဆယ်ရေး)</li>
              <li>095402616 (ပုညကာရီလူမှုကယ်ဆယ်ရေး)</li>
              <li>09771151505 (စေတနာလူမှုကူညီရေးအသင်း)</li>
              <li>09420720713 (စေတနာလူမှုကူညီရေးအသင်း)</li>
              <li>09797905232 (စေတနာလူမှုကူညီရေးအသင်း)</li>
              <li>09797712335 (ကရုဏာရှင်ပရဟိတအသင်း)</li>
              <li>09786545509 (ကရုဏာရှင်ပရဟိတအသင်း)</li>
              <li>09254448800 (ကရုဏာရှင်ပရဟိတအသင်း)</li>
              <li>09420942455 (သုခဒါနပရဟိတအသင်း)</li>
              <li>09773592699 (သုခဒါနပရဟိတအသင်း)</li>
              <li>09779905443 (ဇမ္ဗူတလူ ပရဟိတာအသင်း)</li>
            </ul>
          </div>

          <div className="region">
            <h3>ညောင်ရွှေမြို့ ရေဘေးကယ်ဆယ်ရေး</h3>
            <ul>
              <li>09428310586 (ကိုစိုးမင်းလတ်)</li>
              <li>09261932939 (ကိုသက်ပိုင်စိုး)</li>
              <li>09428311563 (ကိုတိုးအောင်ရွှေ)</li>
            </ul>
          </div>

          <div className="region">
            <h3>နေပြည်တော် တပ်ကုန်း ဆွာ တောင်ငူ ကယ်ဆယ်ရေး</h3>
            <ul>
              <li>0943106850</li>
            </ul>
          </div>

          <div className="region">
            <h3>ဒို့လယ်ဝေးပရဟိတလူငယ်များ အဖွဲ့</h3>
            <ul>
              <li>09681000095</li>
              <li>09797604667</li>
              <li>09775207713</li>
              <li>09972755311</li>
              <li>09420771405 (မိုးစေတနာ)</li>
              <li>09404590001 (မိုးစေတနာ)</li>
              <li>09677080162 (တပ်ကုန်းမီးသတ်)</li>
              <li>09677080126 (တပ်ကုန်းမီးသတ်)</li>
              <li>095044564 (ပုဗ္ဗတွဲလက်များ လူမှု ကူညီရေးအသင်း)</li>
              <li>09420085147 (ဟန်းရာဇာ)</li>
            </ul>
          </div>

          <div className="region">
            <h3>ကျောက်ဆည်ကယ်ဆယ်ရေး</h3>
            <ul>
              <li>KYAUKSE RESCUE</li>
              <li>09256006355</li>
              <li>09258444414</li>
              <li>09787900929 (ကျောက်ဆည်ကြက်ခြေနီ)</li>
              <li>09402526768 (ကျောက်ဆည်ကြက်ခြေနီ)</li>
            </ul>
          </div>

          <div className="region">
            <h3>မြစ်သား</h3>
            <ul>
              <li>09251156006 (မြစ်သားကြက်ခြေနီ)</li>
            </ul>
          </div>

          <div className="region">
            <h3>စဉ့်ကိုင်</h3>
            <ul>
              <li>09788743559 (စဉ့်ကိုင်ကြက်ခြေနီ)</li>
            </ul>
          </div>

          <div className="region">
            <h3>ဝမ်းတွင်းကယ်ဆယ်ရေး</h3>
            <h4>ဝမ်းတွင်းမြို့နယ်လုံးဆိုင်ရာ ပရဟိတ ကွန်ယက်</h4>
            <ul>
              <li>092165003</li>
              <li>09444484129</li>
              <li>09444484128</li>
            </ul>
          </div>

          <div className="region">
            <h3>ပျော်ဘွယ်ကယ်ဆယ်ရေး</h3>
            <ul>
              <li>09449988191 မီးသတ်ဦးစီးမှူး</li>
              <li>092228214 ကိုကျော်ကျော်ဝင်း</li>
              <li>0943020516 ကိုအောင်ဇော်မိုး</li>
              <li>09459975496 ကိုရဲမင်းထွန်း</li>
            </ul>
          </div>

          <div className="region">
            <h3>ရမည်းသင်း ကယ်ဆယ်ရေး</h3>
            <ul>
              <li>09404590001 (မိုးစေတနာ)</li>
              <li>064-4007 (ရမည်းသင်းမီးသတ်)</li>
              <li>064-40787 ရမည်းသင်း</li>
            </ul>
          </div>

          <div className="region">
            <h3>တောင်ငူ ကယ်ဆယ်ရေး</h3>
            <ul>
              <li>09443555502 (T.E.R.Tအသင်း)</li>
              <li>09791232000 (T.Rescueအသင်း)</li>
              <li>09428155773 (မေတ္တာရှင်အသင်း)</li>
              <li>09687635151 (အာယုပါလအသင်း)</li>
              <li>09770313323 (ရှင်စောပုအသင်း)</li>
              <li>09973775151 (၆ရပ်ကွက်အသင်း)</li>
            </ul>
          </div>

          <div className="region">
            <h3>မိတ္ထီလာ ကယ်ဆယ်ရေး</h3>
            <h4>မိတ္ထီလာမြို့ မြန်မာနိုင်ငံလူမှုကယ်ဆယ်ရေး အဖွဲ့ မျိုးဆက်သစ်မြတ်ပါရမီအသင်း</h4>
            <ul>
              <li>09402684996</li>
              <li>09696860666</li>
            </ul>
          </div>
        </div>
        
        
        
        <button className="close-emergency-btn" onClick={onClose}>Close</button>
      </div>
    </div>
  );

  function handleSearch(searchTerm) {
    if (!searchTerm) {
      // If search field is empty, show all regions
      document.querySelectorAll('.region').forEach(region => {
        region.style.display = 'block';
      });
      return;
    }
    
    // Convert search term to lowercase for case-insensitive search
    searchTerm = searchTerm.toLowerCase();
    
    // Filter regions based on search term
    document.querySelectorAll('.region').forEach(region => {
      const regionText = region.textContent.toLowerCase();
      if (regionText.includes(searchTerm)) {
        region.style.display = 'block';
      } else {
        region.style.display = 'none';
      }
    });
  }
}

export default EmergencyContacts;